Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/powermgmt/powermgmt_bad.c
        R_CGC_OperateAt24MHz();
        
//        EM_Start();
    }
}


uint8_t POWERMGMT_ProcessMode3_Pseudo(void)
{
//	R_RTC_Set_ConstPeriodInterruptOn(PES_1_SEC);  /* Turn On one second interrupt to increment disp_timer */
  SAU0EN = 1U;                                    /* SAU0 module */
  SAU1EN = 1U;                                    /* SAU1 module */
  R_UART2_Start();                                /* Start UART2 */
	R_UART3_Start();
  return 0;
}

void POWERMGMT_DoAfterStop(void)
{
	volatile uint8_t config_initial_status;
	
	DI();
	setInterruptPointers();	
	EI();
	
  SAU0EN = 1U;  
  SAU1EN = 1U; 
  R_UART0_Start(); 
  R_UART2_Start(); 
	R_UART3_Start();
	
	POWERMGMT_EXLVD_Action();	// Switch to normal frequency - 24 MHz


//    IICA0EN = 1U;                                   /* IICA0 module */
    DSADCEN = 1U;                                   /* DSAD module */
    TAU0EN = 1U;                                    /* Timer module */
//    SAU0EN = 1U;                                    /* SAU0 module */
//    SAU1EN = 1U;                                    /* SAU1 module */
    ADCEN = 1U;                                     /* ADC 10bit module */
    MACEN = 1U;                                     /* MAC module */
    DTCEN = 1U;                                     /* DTC module */
    VRTCEN = 1U;
    
    R_PORT_Create();                                /* Reinitialize Pin Port */
    R_RTC_Set_ConstPeriodInterruptOn(PES_1_SEC);  /* Set RTC period interrupt */
//    R_RTC_Set_ClockOutputOn(RTCOS_FREQ_1HZ);        /* Set RTC output clock */
    R_TAU0_Channel0_Start();                            /* Stop TAU00 */    
    R_TAU0_Channel1_Start();                            /* Stop TAU00 */    
    R_TAU0_Channel2_Start();                            /* Stop TAU00 */    

		config_initial_status = CONFIG_Init();
    R_DSADC_SetChannelGain(EM_ADC_CURRENT_DRIVER_CHANNEL_PHASE_R, R_DSADC_GetGainEnumValue(EM_CALIB_DEFAULT_GAIN_PHASE_R));
    R_DSADC_SetChannelGain(EM_ADC_CURRENT_DRIVER_CHANNEL_PHASE_Y, R_DSADC_GetGainEnumValue(EM_CALIB_DEFAULT_GAIN_PHASE_Y));
    R_DSADC_SetChannelGain(EM_ADC_CURRENT_DRIVER_CHANNEL_PHASE_B, R_DSADC_GetGainEnumValue(EM_CALIB_DEFAULT_GAIN_PHASE_B));
    R_DSADC_SetChannelGain(EM_ADC_CURRENT_DRIVER_CHANNEL_NEUTRAL, R_DSADC_GetGainEnumValue(EM_CALIB_DEFAULT_GAIN_NEUTRAL));
    
    // Init default ADC Timer offset value  
    EM_ADC_SAMP_SetTimerOffset(EM_CALIB_DEFAULT_TIMER_OFFSET);

		R_TAU0_Channel3_Start();
		EM_Init((EM_PLATFORM_PROPERTY *)&g_EM_DefaultProperty,(EM_CONFIG *)&g_EM_DefaultConfig,(EM_CALIBRATION *)&g_EM_DefaultCalibration);
		config_data_load(config_initial_status);
		CONFIG_Restore(CONFIG_ITEM_CALIB);
		NOP();
		
		startEM();

//    R_UART0_Start();                                /* Start UART0 */
//    R_UART2_Start();                                /* Start UART2 */
//		R_UART3_Start();

    R_INTC0_Start();
//    R_INTC1_Start();
//    R_IICA0_Start();                                /* Start IICA0 module */
    R_LCD_PowerOn();                                /* Start LCD */
//    R_INTC1_Start();    
}


void waitForSupplyToStabilize(void)
{// this function is called when we are running on sub-system clock 32.768KHz
// something no 17 NOPS should do the trick;

	NOP();
	NOP();
	NOP();
	NOP();
	NOP();
	NOP();
	NOP();
	NOP();
	NOP();
	NOP();
	NOP();
	NOP();
	NOP();
	NOP();
	NOP();
	NOP();
	NOP();

}

void POWERMGMT_DoBeforeStop(void)
{
		POWERMGMT_EXLVD_Action();	// Switch to a lower frequency - 6 MHz
				
    LCD_ClearAll();
    R_LCD_PowerOff();                               /* Stop LCD module */
//    R_INTC0_Stop();
//    R_INTC1_Stop();
//    R_IICA0_Stop();                                 /* Stop IICA0 module */
    R_UART0_Stop();                                 /* Stop UART0 module */
    R_UART2_Stop();                                 /* Stop UART0 module */
    R_UART3_Stop();                                 /* Stop UART0 module */
    R_TAU0_Channel0_Stop();                         /* Stop TAU00 */
    R_TAU0_Channel1_Stop();                         /* Stop TAU01 */
    R_TAU0_Channel2_Stop();                         /* Stop TAU02 */
    R_TAU0_Channel3_Stop();                         /* Stop TAU03 */
//    R_RTC_Set_ConstPeriodInterruptOn(PES_2_SEC);  /* Set RTC period interrupt to 2 seconds in mode 4 */
		R_RTC_Set_ConstPeriodInterruptOff();            /* Change RTC to 1 sec interrupt and system */
//		R_RTC_Set_ClockOutputOff();                     /* Disable RTC clock output */
    R_PORT_StopCreate();                            /* Reset pin port state */

    VRTCEN = 0U;	// no luck with this too.
		
//		GDIDIS = 1;		
    /* Stop clock supply to all peripherals (except independent RTC) */
    PER0 = 0x00U;
    PER1 = 0x00U;
    PER2 = 0x00U;
// the following code has been commented on 04/Sep/2020		
/*		
// new code start		
		CSS=1;
		while (CLS!=1);	// wait

		NOP();
		BUPPRT=1;
		VBATSEL=0;
		VBATSEL=1;
		BUPPRT=0;
		
		waitForSupplyToStabilize();	// 500 microseconds at 32.768 KHz clock
		CSS=0;
		while (CLS!=0);
// CPU is now running on VBAT and main system clock		
// new code end	
*/
}

uint8_t POWERMGMT_ProcessMode1(void)
{
  timeinfo_t lastTime;  // minutes,hours,day,date,month,year - use this so that existing single phase incSurveyDate may be used.
	int8_t retryCtr;
	int8_t retval;
	
	if(g_softreset_flag==0)
	{// call this function only we come here and meter has not started from reset
		POWERMGMT_DoAfterStop();
	}
	else
		g_softreset_flag=0;
		
	LCD_ClearAll();

	readRTC();
		
//		asendbare((uint8_t *)"Ent Mode 1\r\n");  		
  if (EM_GetSystemState() != SYSTEM_STATE_RUNNING)
  {
		startEM();
//      if (EM_Start() != EM_OK)
//      {
//          return 1;   // resume fail
//      }
  }

	
//	setInterruptPointers();	// this function call is shifted to POWERMGMT_DoAfterStop
	powerUpDataCheck(1);
	
	do_initial_things(); // required to be done upon return of power
			
  LCD_DisplayAll();	// 19/Aug/2020 - 17:00
//	lcd_display_version();

#ifdef POWER_FAIL_INTERVAL_60
	if(diffInSecondsBetween(rtc, capturedRTC)>59)	// one minute
#else
	if(diffInSecondsBetween(rtc, capturedRTC)>5)
#endif	
	{
		retryCtr=0;
		do
		{
			retval = record_power_fail_event();	// both power fail and power return
			retryCtr++;
			if((retryCtr>5)&&(retval==0))
				retval=1;	// give up after 5 tries
		}
		while(retval==0);
	}
// it is possible that record_power_fail_event may return without writing the power return record
// if the EM has not returned voltage values - too bad - wehave retried 5 times
	g_display_mode=0;	// autoscroll
	sub_disp_state=255;
	disp_state=255;
	disp_timer=disp_autoscroll_interval;
	autoscrollInButtonMode=0;
	alt_autoscroll_mode=0;	// extra line
	avoidShowingRepeatParameters=0;
	
	fast_display_flag=0;	// safety
	someKeyPressed=0;	// safety
	fwdKeyPressed=0;
	revKeyPressed=0;
	
	gujaratSecondsCounter=0;
	init_done=1;
	g_powermgmt_flag.bijliIsThere=1;
	
