Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/powermgmt/powermgmt_bad.c
// check for magnet tamper and ac magnet tamper
// the following code will ensure that if these tampers are not recorded, then the mag icon will be turned off
  if((mytmprdata.tamperEvent_image&MAGNET_MASK) == 0)
	{// magnet tamper is NOT there
		g_TamperStatus&=~HALLSENS_MASK;
	}
	
  if((mytmprdata.tamperEvent_image&AC_MAGNET_MASK) == 0)
	{// magnet tamper is NOT there
		pulsesStartedComingFlag=0;
	}
	
// The variable calswitch is updated only when entering POWERMGMT_Mode1	
	if(CALSW==0)
		calswitch=0;
	else
		calswitch=1;

	clearPersistenceCounters();			
		
  return 0;// Success 
}

uint8_t POWERMGMT_ProcessMode2(void)
{
    // Clear interrupt flag
    if (g_powermgmt_flag.is_rtc_int == 1)       // RTC interrupt wakeup CPU
    {
        g_powermgmt_flag.is_rtc_int = 0;
    }
    return 0;
}


uint8_t POWERMGMT_ProcessMode3(void)
{
//						P3|=0x80;	//E2ROM_SUPPLY_ON - This remains on - SCL, SDA and WP lines are made input
	R_RTC_Set_ConstPeriodInterruptOn(PES_1_SEC);  /* Turn On one second interrupt to increment disp_timer */
	
	P6 =0x05;	// P6.2=1,SDA=0,SCL=1
	PM6 = 0xFA;	// 1111 1010 - P6.2(Out), SDA(Inp), SCL(Out)
	
	R_LCD_PowerOn();

	someKeyPressed=0;	// safety
	fast_display_flag=0;	// safety
	autoscrollInButtonMode=0;	// safety
	alt_autoscroll_mode=0;	// safety
	avoidShowingRepeatParameters=0;
	fwdKeyPressed=0;
	revKeyPressed=0;
	
//	holdState=0;	// safety	
#ifdef POWER_OFF_DISPLAY_MODE_PUSHBUTTON	
	g_display_mode=1;	// pushbutton mode
#else
	g_display_mode=0;	// autoscroll mode
#endif	
	sub_disp_state=0;
	disp_state=255;	// once incremented will start from state 0
	disp_timer=disp_autoscroll_interval;
	
// This is to start the communication module	
//  SAU0EN = 1U;
//  SAU1EN = 1U;
	
// We must also Vcc2 (P57) On
	P5 |=0x80;	// P57=1 - 1000 0000
	
// TXD3(P85) must be output, RXD3(P84) input - already the case
// P85 must be 1
	P8|=0x20;	// 0010 0000 

// IRTXD(P56) must be output, IRRXD(P55) input - already the case
// P56 must be 1
	P5 |=0x40;	// P56=1 - 0100 0000
	
	
//  R_UART2_Start();
//	R_UART3_Start();

// We can turn on AUX_OUT too to enable the other pushbuttons
#ifndef PCB_2_5
	P5|=0x08;	// 0000 0100 - P5.3=1
#endif

	checkCoverTamper();
	
  return 0;
}

uint8_t POWERMGMT_ProcessMode4(void)
{
	switch (g_powermgmt_previous_mode)
	{
    case POWERMGMT_MODE2:
// any pending memory operation must be completed before shutting down
			if(e2write_flags!=0)
			{
		  	wre2rom();
		    R_WDT_Restart();
				return 1;
			}
			
      if (EM_GetSystemState() == SYSTEM_STATE_RUNNING)
      {
        if (EM_Stop() == EM_OK)
        {
          // Do nothing
        }
        else
        {
          return 1;   // Stop EM Core fail
        }
			}
			
			if(g_powermgmt_flag.bijliIsThere==1)
			{
				readRTC();
				capturedRTC=rtc;
  			capturedRTC.Control=calcChecksum((uint8_t*)&capturedRTC,sizeof(capturedRTC)-1);	// line added on 29/Dec/2021
// above line is added where the unused Control variable is used to contain the checksum				
			}			
      // clear all the flag
      g_powermgmt_flag.is_rtc_int  = 0;
      g_powermgmt_flag.is_cover_int  = 0;	// reenabled on 05/Sep/2020 - let us not do this to allow polling of cover open pin
      g_powermgmt_flag.is_key_int  = 0;
      g_powermgmt_flag.is_magnetic_int = 0;
      g_powermgmt_flag.is_hw_key_int = 0;	
			
// clear the pulsing variables
			calWatt = 0;
			total_active_power=0;
			total_active_power_pulsing=0;
#ifdef REACTIVE_PULSING
			calVar = 0;
			total_reactive_power=0;
			total_reactive_power_pulsing=0;
			total_apparent_power_pulsing=0;
#endif
			init_done=0;	// this must be done to prevent certain processing from taking place
//			asendbare((uint8_t *)"Xxx\r\n");  		
      POWERMGMT_DoBeforeStop(); // All peripherals off, system will go to STOP mode in polling processing
#ifdef DISPLAY_AUTO_ON_IN_POWER_OFF_MODE
			if(calswitch!=0)
				gujaratSecondsCounter=64795;
			
			if(gujaratSecondsCounter==0)
			{
				R_RTC_Set_ConstPeriodInterruptOn(PES_1_SEC);  /* Turn On one second interrupt to increment disp_timer */
				g_powermgmt_flag.is_key_int  = 1;	// a soft key interrupt to enable entering MODE3 from MODE4
			}
			else
			{
				g_powermgmt_flag.is_key_int  = 0;	// this is to ensure that MODE3 does not get selected
			}
#else
			R_RTC_Set_ConstPeriodInterruptOn(PES_1_SEC);  /* Turn On one second interrupt to increment disp_timer */
			gujaratSecondsCounter=0;
#endif
// should we turn the one second interrupt on - if not then cover tamper may not get logged in power fail mode
			g_powermgmt_flag.bijliIsThere=0;
      return 0;	// Success
						
    case POWERMGMT_MODE3:
      // Stop LCD and IICA 
      R_LCD_PowerOff();
//		R_IICA0_Stop();
      IICA0EN = 0U;               // IICA0
      VRTCEN = 0U;
      R_PORT_StopCreate();
      return 0;	// Success
            
    // Not support previous mode
    case POWERMGMT_MODE1:
    case POWERMGMT_MODE5:
      return 1;
    }
    return 1; //we are not supposed to come here except in case of an error
}

uint8_t POWERMGMT_ProcessMode5(void)
{
    POWERMGMT_DoAfterStop();
    
    if (EM_GetSystemState() != SYSTEM_STATE_RUNNING)
    {
        // Stop EM Core when it running
        if (EM_Start() != EM_OK)
        {
            return 1;
        }
    }

    return 0;
}

static uint8_t POWERMGMT_SwitchMode(powermgmt_mode_t newmode)
{
  uint8_t status = 0;

  // Process each mode 
  switch (newmode)
  {
    case POWERMGMT_MODE1: // Normal Mode
        status = POWERMGMT_ProcessMode1(); 
        break;
        
    case POWERMGMT_MODE2: // Transient Mode
      status = POWERMGMT_ProcessMode2(); 
      break;
        
    case POWERMGMT_MODE3:  //LCD and Cover Open During Sleep Mode
	    status = POWERMGMT_ProcessMode3();
	    break;
        
    case POWERMGMT_MODE4: // Sleep Mode
      status = POWERMGMT_ProcessMode4();
      break;
        
    case POWERMGMT_MODE5: // Neutral Missing Mode
      status = POWERMGMT_ProcessMode5(); 
      break;
        
    case POWERMGMT_MODE7:   // Debug mode
      status = 0;
      break;
        
    default:
      /* Failed */
      status = 1;
      break;              
  }
  return (status);
}
#endif      /* POWER_MANAGEMENT_ENABLE */

powermgmt_mode_t POWERMGMT_GetMode(void)
{
  #ifdef POWER_MANAGEMENT_ENABLE
//		#ifndef MAGNET_INCREMENTATION	
//        return POWERMGMT_MODE1;
//		#else
        return g_powermgmt_current_mode;
//		#endif		
				
  #else
        return POWERMGMT_MODE1;
  #endif
}

void POWERMGMT_PollingProcessing(void)
{// upon reset the current mode is mode2
  #ifdef POWER_MANAGEMENT_ENABLE
  static uint16_t mode1_counter = 0;
  static uint16_t mode2_counter = 0;
  
